[
  {
    "title": "Figure 1: Login Page",
    "src": "/assets/app/splash.png",
    "description": "The splash screen is displayed during the initial loading of the app. It provides a visually engaging start while the app is being prepared for use."
  },
  {
    "title": "Figure 2: Login Page",
    "src": "/assets/app/login.png",
    "description": "Upon entering the app, users are presented with the login page. From here, they can login, create an account, or continue as guests. If users have created an account but have forgotten the password, they will have the option to go through the password recovery process via the “Forgot Password?” link."
  },
  {
    "title": "Figure 3: Landing Page",
    "src": "/assets/app/landing.png",
    "description": "The landing page serves as a gateway for users to discover and engage with stories related to recent crimes and trending information, providing valuable insights and fostering community awareness and safety."
  },
  {
    "title": "Figure 4: Drawer Menu",
    "src": "/assets/app/drawer.png",
    "description": "When the user clicks on the drawer menu from any of the app’s pages, they will be presented with the menu. This menu will provide them with navigation to the login, dashboard, live monitoring, and about pages."
  },
  {
    "title": "Figure 5: Live Crime Monitoring & Reporting",
    "src": "/assets/app/crime_reporting.png",
    "description": "When the user clicks on the “+” button from the landing page, they will be prompted with the crime reporting feature. This page will let the user enter their location, select which category the crime belongs to, and describe it."
  },
  {
    "title": "Figure 6: Dashboard",
    "src": "/assets/app/dashboard.png",
    "description": "The dashboard provides users with an overview of recent criminal activities in their vicinity. Users can view statistics, trends, and graphs related to crime data. Additionally, they can customize the dashboard layout to prioritize the information they find most relevant."
  },
  {
    "title": "Figure 7: About",
    "src": "/assets/app/about.png",
    "description": "The About page provides information about the app, including its purpose, features, and the development team behind it. Users can learn more about the app's mission and vision here. The page also includes the names of the developers who created the app."
  },
  {
    "title": "Figure 8: Contact Us",
    "src": "/assets/app/contact_us.png",
    "description": "This page serves as a vital platform for users to provide feedback, enabling continuous improvement and future enhancements of the application. Through this page, users can share their thoughts, suggestions, and experiences, which are invaluable for refining features, fixing issues, and shaping the application's roadmap."
  }
]
